export const commentData = [
  {
    id: 1,
    title: 'Аренда детского автокресла Recaro Privia EVO до 13 кг с рождения',
    description: 'Кресло в очень хорошем состоянии, почти как новое. Ирина очень отзывчивая, помогла разобраться.',
    userName: 'Viola Kapskaya',
    userStatus: 'Пользователь',
  },
  {
    id: 2,
    title: 'Аренда спального мешка Northland Hypnos +4',
    description:
      'Я регулярно пользуюсь сервисом, по мне очень выгодно и очень удобно, быстрая доставка, единственное не получилось оплатить apple pay. Познакомились с Александром, нашли много общего, очень рада, что есть кто-то кто заботится о людях искренне...',
    userName: 'Miila Fumushkina',
    userStatus: 'Пользователь',
  },
];
